localization = {
    "welcome_message": {
        "en": "🤖 I undress girls from photos 🔞",
        "ru": "🤖 Я раздеваю девушек по фото 🔞",
        "ua": "🤖 Я роздягаю дівчат по фото 🔞"
    },
    "agreement": {
        "en": '''
        1. To use this bot you must be 18+.
        2. You cannot use other people's photos without their permission.
        3. You are solely responsible for the images you create.
        ⚠️ Before you start interacting with the bot, read the user agreement and privacy policy.
        By clicking the "I agree" button, you confirm that you are 18 years of age and agree to the documents above.''',

        "ru": '''
        1. Для использования этого бота вам должно быть 18+.
        2. Вы не можете использовать чужие фотографии без их разрешения.
        3. Вы несёте полную ответственность за созданные вами изображения.
        ️ Перед тем как начать взаимодействие с ботом, ознакомьтесь с пользовательским соглашением и политикой конфиденциальности.
        Нажав кнопку "Я согласен", вы подтверждаете достижение 18-летнего возраста и согласие с документами выше.''',

        "ua": '''
        1. Для використання цього бота вам має бути 18+.
        2. Ви не можете використовувати чужі фотографії без їхнього дозволу.
        3. Ви несете повну відповідальність за створені вами зображення.
        ⚠️ Перед тим як розпочати взаємодію з ботом, ознайомтеся з користувальницькою угодою та політикою конфіденційності.
        Натиснувши кнопку "Я згоден", ви підтверджуєте досягнення 18-річного віку та згоду з документами вище.'''
    },
    "privacy_policy": {
        "en": "",
        "ru": "",
        "ua": "."
    },
    "bn_pp": {
            "en": "Privacy Policy",
            "ru": "Политика Kонфиденциальности",
            "ua": "Політика Kонфіденційності"
    },
    "bn_pp_agree": {
        "en": "✅ I have read and agree to the user agreement and privacy policy",
        "ru": "✅ Я прочитал и соглашаюсь с пользовательским соглашение и политикой конфиденциальности",
        "ua": "✅ Я прочитав і погоджуюся з угодою користувача та політикою конфіденційності"
    },
    "bn_pp_disagree": {
        "en": "❌ I disagree",
        "ru": "❌ Я не соглашаюсь",
        "ua": "❌ Я не погоджуюсь"
    },
    "account_info": {
        "en": "Аvailable generations: ?\nGenerations used: ?\nRegistration date: ?\nInvited by: ?\nReferrals: ?\nLanguage: ?",
        "ru": "Доступные генерации: ?\nИспользовано генераций: ?\nДата регистрации: ?\nПриглашен: ?\nРефералов: ?\nЯзык: ?",
        "ua": "Доступні генерації: ?\nВикористано генерацій: ?\nДата реєстрації: ?\nЗапрошений: ?\nРефералів: ?\nМова: ?"
    },
    "choose_lang": {
        "en": "Please choose languge✨",
        "ru": "Пожалуйста выберите язык✨",
        "ua": "Будь ласка оберіть мову✨"
    },
    "lang_chosen": {
        "en": "Language is choosen",
        "ru": "Язык выбран!",
        "ua": "Мову обрано!"
    },
    "not_photo": {
        "en": "It's not photo.",
        "ru": "Это не фотография",
        "ua": "Це не фото"
    },
    "wait_photo": {
        "en": "I'm waiting for your photo...",
        "ru": "Жду твое фото...",
        "ua": "Очікую на твоє фото..."
    },
    "generate_photo": {
        "en": "Generating photo.??\nProgress: ?\nYour Position: ?",
        "ru": "Генерация фото.??\nПрогресс: ?\nТвоя позиция: ?",
        "ua": "Генерація фото.??\nПрогрес: ?\nТвоя позиція: ?",
    },
    "generation_done": {
        "en": "Your photo!",
        "ru": "Твоя фотка!",
        "ua": "Твоє фото!"
    },
    "one_more": {
        "en": "Let's do it again :)",
        "ru": "Давай еще :)",
        "ua": "Давай ще :)"
    },
    "run_out": {
        "en": "You've run out of generations",
        "ru": "У вас закончились генерации",
        "ua": "У вас закінчились генерації"
    },
    "select_mode": {
        "en": "The photo is loaded. Select the generation mode.",
        "ru": "Фотография загружена. Выберите режим генерации.",
        "ua": "Фотографія завантажена. Виберіть режим генерації."
    },
    "bn_undress_mode": {
        "en": "UNDRESS",
        "ru": "РАЗДЕВАНИЕ",
        "ua": "РОЗДЯГАННЯ"
    },
    "bn_lingerie_mode": {
        "en": "LINGERIE",
        "ru": "НИЖНЕЕ БЕЛЬЕ",
        "ua": "НИЖНЯ БІЛИЗНА"
    },
    "bn_bikini_mode": {
        "en": "BIKINI",
        "ru": "БИКИНИ",
        "ua": "БІКІНІ"
    },
    "select_body_type": {
        "en": "Now select your body type.",
        "ru": "Теперь выберите тип тела.",
        "ua": "Тепер оберіть тип тіла."
    },
    "bn_auto_body": {
        "en": "AUTO",
        "ru": "АВТО",
        "ua": "АВТО"
    },
    "bn_slim_body": {
        "en": "SLIM",
        "ru": "СТРОЙНЫЙ",
        "ua": "СТРУНКИЙ"
    },
    "bn_skinny_body": {
        "en": "SKINNY",
        "ru": "ХУДОЩАВЫЙ",
        "ua": "ХУДИЙ"
    },
    "bn_curvy_body": {
        "en": "CURVY",
        "ru": "ПЫШНЫЙ",
        "ua": "ПИШНИЙ"
    },
    "bn_athletic_body": {
        "en": "ATHLETIC",
        "ru": "АТЛЕТИЧЕСКИЙ",
        "ua": "АТЛЕТИЧНИЙ"
    },
    "bn_chubby_body": {
        "en": "CHUBBY",
        "ru": "ПУХЛЫЙ",
        "ua": "ПУХКИЙ"
    },
    "bn_hourglass_body": {
        "en": "HOURGLASS",
        "ru": "ПЕСОЧНЫЕ ЧАСЫ",
        "ua": "ПІСОЧНИЙ ГОДИННИК"
    },
    "bn_acc": {
            "en": "Account",
            "ru": "Аккаунт",
            "ua": "Акаунт"
    },
    "bn_faq": {
            "en": "FAQ"
    },
    "bn_menu": {
        "en": "Menu\n",
        "ru": "Меню\n",
        "ua": "Меню\n"
    },
    "bn_upload_photo": {
        "en": "Upload photo",
        "ru": "Загрузить фото",
        "ua": "Завантажити фото"
    },
    "bn_buy_gen": {
        "en": "Buy generations",
        "ru": "Купить генерации",
        "ua": "Придбати генерації"
    },
    "bn_promo": {
        "en": "Promocodes",
        "ru": "Промокоды",
        "ua": "Промокоди"
    },
    "bn_partner":{
        "en": "Partner",
        "ru": "Партнерство",
        "ua": "Партнерство"
    },
    "bn_change_lang": {
        "en": "Change language",
        "ru": "Сменить язык",
        "ua": "Змінити мову"
    },
    "buy_gen": {
        "en": "Choose a value of generations",
        "ru": "Выберите количество генераций",
        "ua": "Оберіть кількість генерацій"
    },
    "bn_back": {
        "en": "Back",
        "ru": "Назад",
        "ua": "Назад"
    },
}


def _(text, lang):
    try:
        return localization[text][lang]
    except:
        try:
            return localization[text]['en']
        except:
            return text
